CSI API ETABS v1

# cPropFrameSetISection Method

---

Initializes an I-type frame section property. If this function is called for
an existing frame section property, all items for the section are reset to
their default value.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetISection(
    	string Name,
    	string MatProp,
    	double T3,
    	double T2,
    	double Tf,
    	double Tw,
    	double T2b,
    	double Tfb,
    	int Color = -1,
    	string Notes = "",
    	string GUID = ""
    )

    Function SetISection (
    	Name As String,
    	MatProp As String,
    	T3 As Double,
    	T2 As Double,
    	Tf As Double,
    	Tw As Double,
    	T2b As Double,
    	Tfb As Double,
    	Optional Color As Integer = -1,
    	Optional Notes As String = "",
    	Optional GUID As String = ""
    ) As Integer

    Dim instance As cPropFrame
    Dim Name As String
    Dim MatProp As String
    Dim T3 As Double
    Dim T2 As Double
    Dim Tf As Double
    Dim Tw As Double
    Dim T2b As Double
    Dim Tfb As Double
    Dim Color As Integer
    Dim Notes As String
    Dim GUID As String
    Dim returnValue As Integer

    returnValue = instance.SetISection(Name,
    	MatProp, T3, T2, Tf, Tw, T2b, Tfb, Color,
    	Notes, GUID)

    int SetISection(
    	String^ Name,
    	String^ MatProp,
    	double T3,
    	double T2,
    	double Tf,
    	double Tw,
    	double T2b,
    	double Tfb,
    	int Color = -1,
    	String^ Notes = L"",
    	String^ GUID = L""
    )

    abstract SetISection :
            Name : string *
            MatProp : string *
            T3 : float *
            T2 : float *
            Tf : float *
            Tw : float *
            T2b : float *
            Tfb : float *
            ?Color : int *
            ?Notes : string *
            ?GUID : string
    (* Defaults:
            let _Color = defaultArg Color -1
            let _Notes = defaultArg Notes ""
            let _GUID = defaultArg GUID ""
    *)
    -> int

#### Parameters

Name

    Type: SystemString
The name of an existing or new frame section property. If this is an existing
property, that property is modified; otherwise, a new property is added.

MatProp

    Type: SystemString
The name of the material property for the section.

T3

    Type: SystemDouble

T2

    Type: SystemDouble

Tf

    Type: SystemDouble

Tw

    Type: SystemDouble

T2b

    Type: SystemDouble

Tfb

    Type: SystemDouble

Color (Optional)

    Type: SystemInt32

Notes (Optional)

    Type: SystemString

GUID (Optional)

    Type: SystemString
The GUID (global unique identifier), if any, assigned to the section. If this
item is input as Default, the program assigns a GUID to the section.

#### Return Value

Type: Int32
Returns zero if the section property is successfully initialized; otherwise it
returns a nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
           Dim SapModel As cSapModel
           Dim EtabsObject As cOAPI
           Dim ret As Integer = -1

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'create SapModel object
           SapModel = EtabsObject.SapModel

       'initialize model
           ret = SapModel.InitializeNewModel()

       'create steel deck template model
           ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)

       'set new frame section property
           ret = SapModel.PropFrame.SetISection("ISEC1", "A992Fy50", 24, 10, 0.5, 0.3, 14, 0.6)

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           SapModel = Nothing
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cPropFrame Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com